---
kind: method
id: M:Autodesk.Revit.DB.ChangeType.Contains(Autodesk.Revit.DB.ChangeType)
source: html/4751264a-45be-31b3-3374-42bd12a17cd3.htm
---
# Autodesk.Revit.DB.ChangeType.Contains Method

Checks whether this ChangeType contains the input ChangeType

## Syntax (C#)
```csharp
public bool Contains(
	ChangeType changeType
)
```

## Parameters
- **changeType** (`Autodesk.Revit.DB.ChangeType`)

## Returns
True if input changeType is contained by this ChangeType

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null